Repository: ngl16647/strohhalm-kleiderausgabe
Catalog: frontend/lib/l10n/intl_*.arb
Languages: de

source: Cancel
de: Abbrechen

source: Accept
de: Akzeptieren

source: Confirm
de: Bestätigen

source: Yes
de: Ja

source: No
de: Nein

source: Delete
de: Löschen

source: Back
de: Zurück

source: Close
de: Schließen

source: Today
de: Heute

source: Update
de: Updaten

source: Save
de: Speichern

source: Success
de: Erfolg

# fail
source: Failure
de: Fehlschlag

source: Apply
de: Anwenden

# application_name
source: Strohhalm Clothing Distribution
de: Strohhalm Kleiderausgabe

# language_de
source: German
de: Deutsch

# language_en
source: English
de: Englisch

# language_ru
source: Russian
de: Russisch

# add_user_requiredFields
source: * Required fields
de: * Pflicht Felder

# add_user_firstName
source: First name*
de: Vorname*

# add_user_lastName
source: Last name*
de: Nachname*

# add_user_birthDay
source: Select birth date*
de: Geburtsdatum wählen*

# add_user_miscellaneous
source: Miscellaneous
de: Sonstiges

# add_user_deleteMessage
source: Are you sure you want to permanently delete this person?
de: Bist du Sicher, dass du diese Person unwiderruflich löschen willst?

# add_user_requiredFieldMissing
source: One of the required fields is empty
de: Eines der Pflichtfelder ist leer

# barCode_scanner_error
source: Please scan a barcode
de: Scanne einen BarCode!

# barCode_scanner_success
source: Barcode scanned successfully
de: Barcode erfolgreich gescannt

# qr_code_print
source: Print QR Code
de: QR-Code Drucken

# qr_code_share
source: Share QR Code
de: QR-Code Exportieren/Teilen

source: Print
de: Drucken

# customer_tile_lastVisit_never
source: Never <bold>visited</bold>
de: War <bold>noch nie</bold> da

# customer_tile_lastVisit_today
source: Visited <bold>today</bold>
de: War <bold>heute</bold> da

# customer_tile_lastVisit_onDate
source: Last visited on <bold>{dateString}</bold>
de: War zuletzt am <bold>{dateString}</bold> da

# customer_tile_deleteLastEntry
source: Delete entry
de: Vermerk löschen

# customer_tile_addNewEntry
source: {visitMoreThan14Days, select, true{Add new visit} false{Add Visit anyway} other{ }}
de: {visitMoreThan14Days, select, true{Neuen Besuch vermerken} false{Trotzdem vermerken} other{ }}

# main_page_languages
source: Languages
de: Sprachen

# main_page_searchUsers
source: {useServer, select, true{Search persons (server)} false{Search persons (lokal)} other{ }}
de: {useServer, select, true{Personen durchsuchen (server)} false{Personen durchsuchen (lokal)} other{ }}

# main_page_add
source: Add
de: Hinzufügen

# main_page_isListView
source: {isListView, select, true{Show as tiles?} false{Show as list?} other{ }}
de: {isListView, select, true{Als Kacheln anzeigen?} false{Als Liste anzeigen?} other{ }}

# main_page_statistic
source: {useServer, select, true{Statistics (server)} false{Statistics (lokal)} other{ }}
de: {useServer, select, true{Statistiken (server)} false{Statistiken (lokal)} other{ }}

# main_page_emptyUserListText
source: Search by name or scan a code to display persons
de: Suche nach einem Namen oder Scanne einen Code um Besucher anzuzeigen

# main_page_noUserWithUUID
source: No matching person found!
de: Es konnte keine passende Person gefunden werden!

# main_page_scanQrCode
source: Scan QR Code
de: QR-Code scannen

# main_page_theme
source: {isDarkMode, select, true{Light Theme} false{Dark Theme} other{ }}
de: {isDarkMode, select, true{Helle Ansicht} false{Dunkle Ansicht} other{ }}

# main_page_fullScreen
source: Fullscreen
de: Vollbild

# stat_page_country
source: Country of origin:
de: Herkunftsland:

# stat_page_children
source: Has children:
de: Hat Kinder:

# stat_page_visits
source: Visits:
de: Besuche:

# stat_page_miscellaneous
source: Miscellaneous:
de: Notizen:

# stat_page_alreadyGotToday
source: Already received something today
de: Hat heute schon was bekommen

# stat_page_savedVisit
source: Visit recorded!
de: Besuch eingetragen!

# stat_page_removeLastVisit
source: Delete last visit
de: Letzten Besuch löschen

# stat_page_removeLastVisitConfirmation
source: Are you sure you want to delete the last visit?
de: Bist du sicher, dass du den letzten Besuch löschen willst?

# stat_page_lastTimeTookClothes
source: Last time clothes borrowed:
de: Letzter Besuch am:

# statistic_page_xAxis
source: {showYear, select, true{Month} false{Day} other{ }}
de: {showYear, select, true{Monat} false{Tag} other{ }}

# statistic_page_numberOfVisits
source: Number of visits
de: Anzahl an Besuchen

# statistic_page_visits
source: {count, plural, one{Visit} other{Visits}}
de: {count, plural, one{Besuch} other{Besuche}}

# statistic_page_switchYearDisplay
source: {showYear, select, true{To month view} false{To year view} other{ }}
de: {showYear, select, true{zur Monatsansicht} false{zur Jahresansicht} other{ }}

# statistic_page_show_top_countries
source: Show top {cutOffNumber} countries of {overAllNumberOfCountries}
de: Zeige die Top {cutOffNumber} von {overAllNumberOfCountries} Ländern

source: Settings
de: Einstellungen

# settings_themeMode_Title
source: Theme
de: Thema

# settings_themeMode_desc
source: Light or Dark mode
de: Heller oder Dunkler Modus

# settings_banner_title
source: Banner / Image
de: Banner / Bild

# settings_banner_desc
source: Image displayed at the top of the page.\nAlso used as header for printing
de: Bild das oben auf der Seite dargestellt wird. Wird außerdem als Header fürs drucken verwendet

# settings_pick_Color
source: Pick color
de: Farbe wählen

# settings_color_title
source: Color
de: Farbe

# settings_color_desc
source: Accent color for the application
de: Akzentfarbe für die Anwendung

# settings_server_title
source: Server Settings
de: Server Einstellungen

# settings_server_desc
source: If a server is to be used, URL and password can be entered here
de: Falls ein Server verwendet werden soll können hier Url und API-Schlüssel eingegeben werden

# settings_server_switch
source: Use server?
de: Server verwenden?

# settings_server_tokenHint
source: Password
de: Passwort

# settings_saveServerSettings
source: Save server settings to check for connection
de: Server-Einstellungen speichern, um Verbindung zu prüfen

# settings_downloadFromServer
source: Download from server
de: Vom Server herunterladen

# settings_noConnection
source: No connection!
de: Keine Verbindung!

# settings_exportCsvFile
source: Export CSV file
de: CSV-Import/-Export

# settings_exportCsvDescription
source: Export a CSV file (which can be imported in e.g. Excel) If the database on the server is empty, a CSV file can be uploaded.
de: Exportiere oder Importiere eine CSV-Datei Daten können nur importiert werden, wenn die Zieldatenbank leer ist!

# settings_exportCsvLocal
source: Export CSV locally (Server compatible)
de: CSV lokal exportieren

# settings_exportLessDetailsToolTip
source: Exports a CSV with: id First name Last name Country as code Notes Visits
de: Exportiert eine CSV mit: id Vorname Nachname Land als Code Notizen Besuchen

# settings_exportToolTip
source: Exports a CSV with: id First name Last name Country as full name Notes Number of visits Visits with timestamp
de: Exportiert eine CSV mit: id Vorname Nachname Land als ganzer Name Notizen Anzahl an Besuchen Besuche mit Uhrzeit

# settings_exportDetailedCsvLocal
source: Export detailed CSV locally (Server incompatible)
de: Detaillierte CSV lokal exportieren

# settings_downloadCSVFromServer
source: Download a CSV file (Excel)
de: Downloade CSV-Datei (Excel)

# settings_exportCsvFromServer
source: Export CSV from server
de: CSV vom Server exportieren

# settings_uploadCsvToServer
source: Upload CSV to server
de: CSV zum Server hochladen

# settings_uploadCsvToServerToolTip
source: Importiere a exported CSV-File to the Server. Online possible if server-Database is empty!
de: Importiere eine exportierte CSV-Datei in den Server. Geht nur, wenn die Server-Datenbank leer ist!

# settings_exportCsvDialogTitle
source: Export data as CSV
de: Daten als CSV exportieren

# settings_importCsvToolTip
source: Import a compatible CSV-File (CSV with less Details!)
de: Importiere eine kompatible CSV-Datei

# settings_importCsv
source: Import a compatible CSV-File
de: Importiere eine CSV-Datei

# settings_switchWarningMessage
source: <bigger><bold>Warning!</bold></bigger> The server database and the local database are separate. It is possible to add the server database to the local one – but <bold>not</bold> the other way around! <bigger>No data will be lost when switching.</bigger> Do you want to switch?
de: <bigger><bold>Achtung!</bold></bigger> Die Server-Datenbank und die lokale Datenbank sind getrennt. Es ist möglich die Datenbanken als CSV zu exportieren und importieren solange nicht bereits Einträge existieren! <bigger>Beim Umschalten gehen <bold>keine</bold> Daten verloren.</bigger> Willst du umschalten?

# banner_designer_wrongAspectRatio
source: The image's aspect ratio is too small! It should be at least 6:1
de: Das Seitenverhältnis des Bildes ist zu klein! Sollte mindestens 6:1 sein

# banner_designer_pick
source: Select
de: Auswählen

# banner_designer_picked
source: Just selected!
de: Gerade Ausgewählt!

# banner_designer_delete
source: Delete
de: Löschen

# banner_designer_new
source: New
de: Neu

# banner_designer_existing
source: Existing
de: Vorherige

# banner_designer_bannerImageSubTitle
source: Image
de: Bild

# banner_designer_bannerImageTitle
source: Banner Image
de: Banner Bild

# banner_designer_titleText
source: Title
de: Überschrift

# banner_designer_noImage
source: No image selected
de: Kein Bild ausgewählt

# banner_designer_uploadImage
source: Upload image
de: Bild hochladen

# deletion_request_page_title
source: inactive Visitors
de: Inaktive Besucher

# deletion_request_page_lastVisit
source: Last Visit:
de: Letzter Besuch:

# deletion_request_page_resetUser
source: reset Visitor
de: Der letzte Besuch des Besuchers wird auf „Noch Nie“ gesetzt

# deletion_request_page_delete
source: delete Visitor
de: Besucher löschen

# deletion_request_page_deleteAll
source: Delete All
de: Alle löschen

# deletion_request_page_deleteAllDesc
source: Delete All old Customers at once
de: Alle inaktiven Besucher auf einmal Löschen?

source: Deletion failed
de: Löschen fehlgeschlagen

# deletion_success
source: Deletion successful
de: Löschen erfolgreich

# add_failed
source: Adding failed
de: Hinzufügen fehlgeschlagen

# add_success
source: Adding successful
de: Hinzufügen erfolgreich

source: Update failed
de: Update fehlgeschlagen

# update_success
source: Update successful
de: Update erfolgreich

# number_fail
source: Invalid number! Please enter a correct number
de: Keine erlaubte Zahl! Bitte gib eine korrekte Zahl ein

# uuId_fail_keyboard
source: Failed UuId Check! Make sure your Keyboard-Language (Left-Alt + Left-Shift) is the same as the Barcode-Scanner!
de: uuId-Check Fehlgeschlagen!! Stelle sicher, dass die Tastatur/System-Sprache (Links-Alt + Links-Umschalt) die gleiche ist, die auch beim Scanner eingestellt ist!

# visit_plural
source: {count, plural, =1{Visit} other{Visits}}
de: {count, plural, =1{Besuch} other{Besuche}}

# statistic_page_visitsPerVisitor
source: {visitorCount, plural, =1{{visitorCount} Visitor} other{{visitorCount} Visitors}} have {visitCount} {visitCount, plural, =1{Visit} other{Visits}}
de: {visitorCount, plural, =1{{visitorCount} Besucher} other{{visitorCount} Besucher}} mit {visitCount} {visitCount, plural, =1{Besuch} other{Besuche}}

# statistic_page_visitsPerPerson
source: Visitors per Visit-Number
de: Besucher pro Besuch-Anzahl

# statistic_page_visitsPerPerson_Persons
source: Number of Visitors
de: Anzahl von Besuchern

# statistic_page_visitsPerPerson_Visits
source: Number of Visits
de: Anzahl von Besuchen

# statistic_page_noData
source: No data or internet connection. Data will automatically load once internet is available!
de: Keine Daten oder Internetverbindung. Sobald wieder eine Verbindung hergestellt wurde, werden die Daten automatisch geladen!

# same_user_exists
source: User with same Data already existed!
de: Benutzer mit gleichen Daten existiert schon!

# no_internet
source: No Connection to Internet
de: Keine Verbindung zum Internet

# no_server
source: No Connection to Server
de: Keine Verbindung zum Server

source: Reconnected!
de: Verbindung wieder hergestellt

# print_width
source: Width
de: Breite

# print_height
source: Height
de: Höhe

# deletionRequest_restore
source: Restore
de: Wiederherstellen

# deletionRequest_buttonTitle
source: Deletion Requests
de: Löschungs Anträge

# csv_conversion_failed
source: Failed to convert to CSV
de: Fehler beim Konvertieren zu CSV

source: Password
de: Passwort

# password_false
source: Incorrect Password
de: Falsches Passwort

source: Dark Mode
de: Dunkler Modus

source: Edit
de: Bearbeiten

# statistic_page_visitsPerPeriod
source: Visits per Month/Year
de: Besuche pro Monat/Jahr

# no_data
source: No data available
de: Keine Daten verfügbar

# country_Name_worldWideReplacement
source: Not specified
de: Keine Angabe

# load_more
source: {isLoading, select, true{loading...} false{Load more...} other{Everything loaded!}}
de: {isLoading, select, true{Lade...} false{Mehr laden...} other{Alles geladen!}}

# closesIn
source: Closes in {countDown} seconds
de: Schließt in {countDown} Sekunden

# visit_added_success
source: Visit added successfully!
de: Besuch erfolgreich eingetragen!

# visit_added_error
source: {isBefore14Days, select, true{Error while adding Visitor was here in the last 14 days} false{Error while adding No connection to Server} other{ }}
de: {isBefore14Days, select, true{Fehler beim eintragen Besucher war in den letzten 14 Tagen bereits da} false{Fehler beim eintragen Keine Verbindung zum Server} other{ }}

source: online Database
de: online Datenbank

source: offline Database
de: offline Datenbank

# countryErrorMessage
source: We couldn’t detect your country automatically. Please select a country from the following list. If you don’t want to provide details, choose <bold>Worldwide</bold>.
de: Das Land konnte nicht automatisch erkannt werden. Bitte wähle ein Land aus der nachfolgenden Liste aus. Wenn du keine genaueren Angaben machen möchtest, wähle <bold>Weltweit</bold>.

# countryErrorButton
source: Open List
de: Liste öffnen

# window_title
source: Visitor Check-In
de: Besucher Check-In

source: Reset
de: Zurücksetzen

# server_display_toolTip
source: Shows you if the local or online-Database is used
de: Zeigt ob die lokale oder online-Datenbank verwendet wird

source: saved
de: gespeichert
